package Ch02Su;

public class C01양의정수 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
//2+128=130
//11001010=2+8+64+128=204
//10110101=1+4+16+32+128=53+128=181
//00101101=1+4+8+32=45
//
//75=		01001011
//45=		00101101
//112=		01110000
//68=		01000100
//		데이터는 기본적으로 저장 이후에 연산처리가 된다
//		데이터를 저장하기 위해서는 저장할 데이터의 종류를 먼저
//		파악한 후 데이터의 구조에 맞게 저장을 해야한다
//		정수형 데이터는 10진수에서 기계가 이해하는 2진수로
//		진법 변환되어 저장이 되게 되는데 이때 변환된 2진데이터를 담는
//		최소 공간단위를  bit라고 한다 
	}

}
